[Language]
Main_Title=Gracias por elegir EaseUS Data Recovery Wizard
Sub_Title=¿Cómo calificaría esta experiencia?
Terrible=Terrible
Poor=Deficiente
Good=Normal
Great=Estupenda
Excellent=Excelente
Never_Ask_Again=No volver a preguntar
Rate_Now=Calificar ahora
Feedback_Text_Tips=Por favor deje sus comentarios aquí.
Feedback_Length_Tips=Ha escrito más de 500 palabras.Por favor, envíe más comentarios a support@easeus.com.
